test/wrk2_wsk/social_network/qps_1000/output_compose-post-merged-async_50.log
Running 10m test @ http://130.127.133.207:32001
  1 threads and 50 connections
  Thread calibration: mean lat.: 8853.211ms, rate sampling interval: 19070ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.04m     2.64m    9.56m    58.13%
    Req/Sec    43.97      5.36    49.00     90.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.04m 
 75.000%    7.35m 
 90.000%    8.67m 
 99.000%    9.47m 
 99.900%    9.56m 
 99.990%    9.57m 
 99.999%    9.57m 
100.000%    9.57m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10084.351     0.000000            1         1.00
   80805.887     0.100000         2627         1.11
  139853.823     0.200000         5258         1.25
  196214.783     0.300000         7880         1.43
  250216.447     0.400000        10509         1.67
  302252.031     0.500000        13132         2.00
  328204.287     0.550000        14454         2.22
  359923.711     0.600000        15761         2.50
  386400.255     0.650000        17072         2.86
  413663.231     0.700000        18393         3.33
  441188.351     0.750000        19707         4.00
  454557.695     0.775000        20353         4.44
  466616.319     0.800000        21008         5.00
  480247.807     0.825000        21676         5.71
  493092.863     0.850000        22326         6.67
  506724.351     0.875000        22990         8.00
  513277.951     0.887500        23319         8.89
  520355.839     0.900000        23639        10.00
  527171.583     0.912500        23967        11.43
  533463.039     0.925000        24297        13.33
  541065.215     0.937500        24634        16.00
  544735.231     0.943750        24797        17.78
  547356.671     0.950000        24953        20.00
  551550.975     0.956250        25148        22.86
  554696.703     0.962500        25281        26.67
  557318.143     0.968750        25451        32.00
  559415.295     0.971875        25531        35.56
  560988.159     0.975000        25639        40.00
  562036.735     0.978125        25697        45.71
  564133.887     0.981250        25784        53.33
  565182.463     0.984375        25859        64.00
  565706.751     0.985938        25896        71.11
  566755.327     0.987500        25950        80.00
  567803.903     0.989062        25985        91.43
  568852.479     0.990625        26040       106.67
  569376.767     0.992188        26065       128.00
  569901.055     0.992969        26097       142.22
  569901.055     0.993750        26097       160.00
  570425.343     0.994531        26130       182.86
  570949.631     0.995313        26161       213.33
  570949.631     0.996094        26161       256.00
  571473.919     0.996484        26195       284.44
  571473.919     0.996875        26195       320.00
  571473.919     0.997266        26195       365.71
  571998.207     0.997656        26210       426.67
  571998.207     0.998047        26210       512.00
  572522.495     0.998242        26217       568.89
  573046.783     0.998437        26229       640.00
  573046.783     0.998633        26229       731.43
  573571.071     0.998828        26256       853.33
  573571.071     0.999023        26256      1024.00
  573571.071     0.999121        26256      1137.78
  573571.071     0.999219        26256      1280.00
  573571.071     0.999316        26256      1462.86
  573571.071     0.999414        26256      1706.67
  573571.071     0.999512        26256      2048.00
  573571.071     0.999561        26256      2275.56
  573571.071     0.999609        26256      2560.00
  573571.071     0.999658        26256      2925.71
  573571.071     0.999707        26256      3413.33
  573571.071     0.999756        26256      4096.00
  573571.071     0.999780        26256      4551.11
  573571.071     0.999805        26256      5120.00
  573571.071     0.999829        26256      5851.43
  574095.359     0.999854        26260      6826.67
  574095.359     1.000000        26260          inf
#[Mean    =   302493.873, StdDeviation   =   158491.799]
#[Max     =   573571.072, Total count    =        26260]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  996.86ms
 75.000%    1.31s 
 90.000%    1.80s 
 99.000%    2.40s 
 99.900%   10.49s 
 99.990%   11.87s 
 99.999%   12.31s 
100.000%   12.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     398.591     0.000000            1         1.00
     698.367     0.100000         2664         1.11
     795.647     0.200000         5348         1.25
     807.935     0.300000         7891         1.43
     901.119     0.400000        10580         1.67
     996.863     0.500000        13218         2.00
    1003.519     0.550000        14480         2.22
    1095.679     0.600000        15857         2.50
    1105.919     0.650000        17082         2.86
    1203.199     0.700000        18427         3.33
    1309.695     0.750000        19698         4.00
    1402.879     0.775000        20364         4.44
    1500.159     0.800000        21028         5.00
    1597.439     0.825000        21705         5.71
    1692.671     0.850000        22321         6.67
    1708.031     0.875000        22979         8.00
    1797.119     0.887500        23365         8.89
    1802.239     0.900000        23638        10.00
    1890.303     0.912500        23966        11.43
    1899.519     0.925000        24347        13.33
    1906.687     0.937500        24628        16.00
    1992.703     0.943750        24792        17.78
    1997.823     0.950000        24967        20.00
    2001.919     0.956250        25124        22.86
    2027.519     0.962500        25276        26.67
    2099.199     0.968750        25475        32.00
    2101.247     0.971875        25522        35.56
    2107.391     0.975000        25625        40.00
    2189.311     0.978125        25690        45.71
    2199.551     0.981250        25781        53.33
    2209.791     0.984375        25853        64.00
    2293.759     0.985938        25898        71.11
    2299.903     0.987500        25934        80.00
    2361.343     0.989062        25973        91.43
    2404.351     0.990625        26014       106.67
    2508.799     0.992188        26055       128.00
    2598.911     0.992969        26079       142.22
    2633.727     0.993750        26096       160.00
    2717.695     0.994531        26117       182.86
    2801.663     0.995313        26138       213.33
    2906.111     0.996094        26158       256.00
    3002.367     0.996484        26169       284.44
    3262.463     0.996875        26178       320.00
    3403.775     0.997266        26189       365.71
    3502.079     0.997656        26199       426.67
    3930.111     0.998047        26209       512.00
    4116.479     0.998242        26214       568.89
    4292.607     0.998437        26219       640.00
    4399.103     0.998633        26226       731.43
    5808.127     0.998828        26230       853.33
   10641.407     0.999023        26236      1024.00
   10657.791     0.999121        26237      1137.78
   10739.711     0.999219        26240      1280.00
   10960.895     0.999316        26243      1462.86
   11247.615     0.999414        26245      1706.67
   11452.415     0.999512        26248      2048.00
   11501.567     0.999561        26249      2275.56
   11509.759     0.999609        26250      2560.00
   11534.335     0.999658        26252      2925.71
   11550.719     0.999707        26253      3413.33
   11591.679     0.999756        26254      4096.00
   11632.639     0.999780        26255      4551.11
   11632.639     0.999805        26255      5120.00
   11780.095     0.999829        26256      5851.43
   11870.207     0.999854        26257      6826.67
   11870.207     0.999878        26257      8192.00
   12001.279     0.999890        26258      9102.22
   12001.279     0.999902        26258     10240.00
   12001.279     0.999915        26258     11702.86
   12050.431     0.999927        26259     13653.33
   12050.431     0.999939        26259     16384.00
   12050.431     0.999945        26259     18204.44
   12050.431     0.999951        26259     20480.00
   12050.431     0.999957        26259     23405.71
   12312.575     0.999963        26260     27306.67
   12312.575     1.000000        26260          inf
#[Mean    =     1133.412, StdDeviation   =      559.261]
#[Max     =    12304.384, Total count    =        26260]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26282 requests in 10.00m, 12.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 390
Requests/sec:     43.80
Transfer/sec:     20.49KB